---
type: RailingType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 13
tags: [revit-api, class]
---

# RailingType

`Autodesk.Revit.DB.Architecture.RailingType` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BalusterPlacement | 2019 | `public BalusterPlacement BalusterPlacement { get ; }` |
| Property | Parameter | — | `` |
| Property | PrimaryHandRailPosition | 2013 | `public HandRailPosition PrimaryHandRailPosition { get ; set ; }` |
| Property | PrimaryHandrailHeight | 2013 | `public double PrimaryHandrailHeight { get ; }` |
| Property | PrimaryHandrailLateralOffset | 2013 | `public double PrimaryHandrailLateralOffset { get ; }` |
| Property | PrimaryHandrailType | 2013 | `public ElementId PrimaryHandrailType { get ; set ; }` |
| Property | RailStructure | 2019 | `public NonContinuousRailStructure RailStructure { get ; }` |
| Property | SecondaryHandRailPosition | 2013 | `public HandRailPosition SecondaryHandRailPosition { get ; set ; }` |
| Property | SecondaryHandrailHeight | 2013 | `public double SecondaryHandrailHeight { get ; }` |
| Property | SecondaryHandrailLateralOffset | 2013 | `public double SecondaryHandrailLateralOffset { get ; }` |
| Property | SecondaryHandrailType | 2013 | `public ElementId SecondaryHandrailType { get ; set ; }` |
| Property | TopRailHeight | 2013 | `public double TopRailHeight { get ; set ; }` |
| Property | TopRailType | 2013 | `public ElementId TopRailType { get ; set ; }` |